def area(a, b):
    '''
    Возвращает площадь прямоугольника.

    Параметры:
        a (int/float): длина первой стороны прямоугольника
        b (int/float): длина второй стороны прямоугольника

    Возвращаемое значение:
        area (int/float): площадь прямоугольника (произведение сторон a и b)
    '''
    return a * b


def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника.

    Параметры:
        a (int/float): длина первой стороны прямоугольника
        b (int/float): длина второй стороны прямоугольника

    Возвращаемое значение:
        perimeter (int/float): периметр прямоугольника (удвоенная сумма a и b)
    '''
    return 2 * (a + b)