def area(a, h):
    '''
    Возвращает площадь треугольника.

    Параметры:
        a (int/float): длина основания треугольника
        h (int/float): высота, опущенная на основание a

    Возвращаемое значение:
        area (int/float): площадь треугольника (произведение a и h, поделённое на 2)
    '''
    return a * h / 2


def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника.

    Параметры:
        a (int/float): длина первой стороны треугольника
        b (int/float): длина второй стороны треугольника
        c (int/float): длина третьей стороны треугольника

    Возвращаемое значение:
        perimeter (int/float): периметр треугольника (сумма a, b и c)
    '''
    return a + b + c